# [SQL Database](https://www.w3schools.com/sql/sql_create_db.asp)

In [1]:
!pip install "SQLAlchemy<1.4"

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting SQLAlchemy<1.4
  Downloading SQLAlchemy-1.3.24.tar.gz (6.4 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 6.4/6.4 MB 49.6 MB/s eta 0:00:00
  Preparing metadata (setup.py) ... done
Building wheels for collected packages: SQLAlchemy
  Building wheel for SQLAlchemy (setup.py) ... done
  Created wheel for SQLAlchemy: filename=SQLAlchemy-1.3.24-cp310-cp310-linux_x86_64.whl size=1268261 sha256=1d4fb7e39a410c14f734837eaffa2ec0174fb7f55e368b5e6ad790d869bdce04
  Stored in directory: /root/.cache/pip/wheels/27/51/b3/3481e88d5a5ba95dd4aafedc9316774d941c4ba61cfb93add8
Successfully built SQLAlchemy
Installing collected packages: SQLAlchemy
  Attempting uninstall: SQLAlchemy
    Found existing installation: SQLAlchemy 2.0.10
    Uninstalling SQLAlchemy-2.0.10:
      Successfully uninstalled SQLAlchemy-2.0.10
Successfully installed SQLAlchemy-1.3.24

In [2]:
%load_ext sql

    CREATE DATABASE testDB;

    DROP DATABASE testDB;

    BACKUP DATABASE databasename
    TO DISK = 'filepath'
    WITH DIFFERENTIAL;

In [3]:
%%sql

sqlite:///testDB.db

In [7]:
%%sql

CREATE TABLE Persons (
    PersonID int,
    LastName varchar(255),
    FirstName varchar(255),
    Address varchar(255),
    City varchar(255)
);

 * sqlite:///testDB.db
Done.

[]

In [11]:
%%sql

CREATE TABLE TestTable AS
SELECT PersonID, FirstName
FROM Persons;

 * sqlite:///testDB.db
Done.

[]

In [9]:
%%sql

DROP TABLE TestTable;

 * sqlite:///testDB.db
Done.

[]

    TRUNCATE TABLE TestTable;

    ALTER TABLE Persons
    DROP COLUMN Email;

In [13]:
%%sql select * from Persons;

 * sqlite:///testDB.db
Done.

[]

In [14]:
%%sql

ALTER TABLE Persons
ADD Email varchar(255);

 * sqlite:///testDB.db
Done.

[]

In [15]:
%%sql select * from Persons;

 * sqlite:///testDB.db
Done.

[]

In [19]:
%%sql

ALTER TABLE Persons
ADD DateOfBirth date;

 * sqlite:///testDB.db
Done.

[]

In [20]:
%%sql select * from Persons;

 * sqlite:///testDB.db
Done.

[]

    ALTER TABLE Customers
    ALTER COLUMN Age int NOT NULL;

In [27]:
%%sql

CREATE TABLE Humans (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    CONSTRAINT UC_Person UNIQUE (ID,LastName)
);

 * sqlite:///testDB.db
Done.

[]

In [28]:
%%sql

CREATE TABLE Creatures (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    PRIMARY KEY (ID)
);

 * sqlite:///testDB.db
Done.

[]

In [29]:
%%sql

CREATE TABLE Orders (
    OrderID int NOT NULL,
    OrderNumber int NOT NULL,
    PersonID int,
    PRIMARY KEY (OrderID),
    FOREIGN KEY (PersonID) REFERENCES Persons(PersonID)
);

 * sqlite:///testDB.db
Done.

[]

In [24]:
%%sql

CREATE TABLE Customers (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255) NOT NULL,
    Age int
);

 * sqlite:///testDB.db
Done.

[]

In [32]:
%%sql

INSERT INTO Customers
(ID, LastName, FirstName, Age)

VALUES (1, 'Skagen', 'Stavanger', 27);

 * sqlite:///testDB.db
1 rows affected.

[]

In [33]:
%%sql select * from Customers;

 * sqlite:///testDB.db
Done.

[(1, 'Skagen', 'Stavanger', 27)]

In [36]:
%%sql

INSERT INTO Customers
(ID, LastName, FirstName, Age)

VALUES
(2, 'Kumar', 'Vicky', 24),
(3, 'Jangid', 'Sagar', NULL);

 * sqlite:///testDB.db
2 rows affected.

[]

In [37]:
%%sql

SELECT ID, LastName, FirstName
FROM Customers
WHERE Age IS NULL;

 * sqlite:///testDB.db
Done.

[(3, 'Jangid', 'Sagar')]

In [38]:
%%sql

UPDATE Customers
SET LastName = 'Singh', Age = 25
WHERE ID = 2;

 * sqlite:///testDB.db
1 rows affected.

[]

In [39]:
%%sql select * from Customers;

 * sqlite:///testDB.db
Done.

[(1, 'Skagen', 'Stavanger', 27),
 (2, 'Singh', 'Vicky', 25),
 (3, 'Jangid', 'Sagar', None)]

In [40]:
%%sql

DELETE FROM Customers WHERE FirstName = 'Stavanger';

 * sqlite:///testDB.db
1 rows affected.

[]

In [41]:
%%sql select * from Customers;

 * sqlite:///testDB.db
Done.

[(2, 'Singh', 'Vicky', 25), (3, 'Jangid', 'Sagar', None)]

In [46]:
%%sql

SELECT * FROM Customers
LIMIT 2;

 * sqlite:///testDB.db
Done.

[(2, 'Singh', 'Vicky', 25), (3, 'Jangid', 'Sagar', None)]

In [50]:
%%sql

CREATE TABLE Janta (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    CHECK (Age>=18)
);

 * sqlite:///testDB.db
Done.

[]

# SQL Views

    SQL CREATE VIEW Statement

In SQL, a view is a `virtual table` based on the result-set of an SQL statement.

A view contains rows and columns, just like a real table.

The fields in a view are fields from one or more real tables in the database.

You can add SQL statements and functions to a view and present the data as if the data were coming from one single table.

A view is created with the **`CREATE VIEW`** statement.

In [52]:
%%sql

CREATE VIEW [Indian Customers] AS
SELECT LastName, FirstName
FROM Customers
WHERE Age = 25;

 * sqlite:///testDB.db
Done.

[]

In [54]:
%%sql SELECT * FROM [Indian Customers];

 * sqlite:///testDB.db
Done.

[('Singh', 'Vicky')]

    CREATE OR REPLACE VIEW [Brazil Customers] AS
    SELECT CustomerName, ContactName, City
    FROM Customers
    WHERE Country = 'Brazil';